Assignment1/app/controllers/students_controller.rb

INSERT INTO "students" ("student_id", "department", "maths", "physics", "chemistry", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["student_id", 1], ["department", "a1"], ["maths", 43], ["physics", 54], ["chemistry", 65], ["year", 2016], ["created_at", 2016-11-28 12:03:40 UTC], ["updated_at", 2016-11-28 12:03:40 UTC]]
---
  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save

SELECT "students".* FROM "students"
---
  def filter
    students = Student.all