Assignment1/app/views/students/_form.html.erb

SELECT "colleges".* FROM "colleges"
---
    <%= f.label :college_id, 'College' %>
    <%= f.collection_select :college_id, College.all, :id, :name, {:prompt => 'Select college'} %>